Revit 2027 API
UnitUtils.GetAllUnits Method
 Gets the identifiers of all available units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllUnits()
Public Shared Function GetAllUnits As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllUnits()
static member GetAllUnits : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The unit identifiers.
See Also
Reference
UnitUtils Class
Autodesk.Revit.DB Namespace